In [71]:
# Imports
import pandas as pd
import numpy as np
import datetime as dt
from pathlib import Path
%matplotlib inline

# Win Loss Record

This data set contains the historical win loss records for each NBA team beginning with the 1999-2000 season.

In [90]:
# Bring in NBA Records CSV
nba_records_csv = Path('../Kevin_Files/Win_Loss.csv')
# Read csv into a pandas Dataframe
nba_records = pd.read_csv(nba_records_csv)
nba_records = nba_records.set_index('Season')
nba_records.head()

                      Team  GP   W   L   WIN%
Season
2019-20      Atlanta Hawks  67  20  47  0.299
2019-20     Boston Celtics  72  48  24  0.667
2019-20      Brooklyn Nets  72  35  37  0.486
2019-20  Charlotte Hornets  65  23  42  0.354
2019-20      Chicago Bulls  65  22  43  0.338

In [91]:
# Count the nulls in the data
nba_records.isnull().sum()

Team    0
GP      0
W       0
L       0
WIN%    0
dtype: int64

In [92]:
# Filter dataframe to be inclusive of only the 2008-09 season through the 2017-18 season
#df = nba_records[(nba_records['Season']== '2019-20')] #& (nba_records['Season']=='2018-19')]

# NBA Salaries
This csv file contains the historical salary spend for each NBA team beginning in the 2008 - 2009 season. This information is both inclusive and exclusive of inflation.

In [93]:
# Bring in NBA Salary Information
nba_salary_csv = Path('../nba_salaries.csv')
# Read CSV into a Pandas Dataframe
nba_salaries = pd.read_csv(nba_salary_csv)
nba_salaries = nba_salaries.rename(columns={'Year':'Season'})
nba_salaries.sort_values('Team',ascending=False)
nba_salaries.head()

      Season       Team        Salary Salary w/ Inflation
0  2008/2009   New York  $96,643,646        $113,130,233
1  2008/2009     Dallas  $95,045,559        $111,259,524
2  2008/2009  Cleveland  $91,298,233        $106,872,938
3  2008/2009   Portland  $80,260,059         $93,951,741
4  2008/2009     Boston  $79,188,973         $92,697,938

In [94]:
# Count the nulls in the data
nba_salaries.isnull().sum()

Season                 0
Team                   0
Salary                 0
Salary w/ Inflation    0
dtype: int64

In [95]:
# Formatting the Seasons column to match the syntax in the nba_record dataframe
old_seasons = ['2008/2009','2009/2010','2010/2011','2011/2012','2012/2013','2013/2014','2014/2015','2015/2016','2016/2017','2017/2018']
new_seasons = ['2008-09','2009-10','2010-11','2011-12','2012-13','2013-14','2014-15','2015-16','2016-17','2017-18']
nba_salaries['Season'] = nba_salaries['Season'].replace(old_seasons,new_seasons)
nba_salaries.head()

    Season       Team        Salary Salary w/ Inflation
0  2008-09   New York  $96,643,646        $113,130,233
1  2008-09     Dallas  $95,045,559        $111,259,524
2  2008-09  Cleveland  $91,298,233        $106,872,938
3  2008-09   Portland  $80,260,059         $93,951,741
4  2008-09     Boston  $79,188,973         $92,697,938

In [96]:
# Setting the Season columns as the Index
nba_salaries = nba_salaries.set_index('Season')

In [97]:
# Formatting the Team column to match the syntach in the nba_record dataframe
# Extracting the 'Team' format from nba_salaries dataframe
salary_team = nba_salaries.groupby(nba_salaries.index)['Team'].unique()
# Extracting the 'Team' format from nba_records dataframe
record_team = nba_records.groupby(nba_records.index)['Team'].unique()

In [99]:
# Replace the Team names in nba_salaries with the team attributes from nba_records
nba_salaries['Team'] = nba_salaries['Team'].replace(salary_team['2008-09'],record_team['2008-09'])
nba_salaries.head()

                       Team        Salary Salary w/ Inflation
Season
2008-09  Washington Wizards  $96,643,646        $113,130,233
2008-09           Utah Jazz  $95,045,559        $111,259,524
2008-09     Toronto Raptors  $91,298,233        $106,872,938
2008-09   San Antonio Spurs  $80,260,059         $93,951,741
2008-09    Sacramento Kings  $79,188,973         $92,697,938

In [112]:
# Concat

Empty DataFrame
Columns: [Team, GP, W, L, WIN%, Salary, Salary w/ Inflation]
Index: []